


<?php

//博客项目的目录划分
----index.php 			//前台入口文件
----admin.php 			//后台入口文件
----Frame/				//框架核心类文件
--------Libs/			//自定义公共类文件
--------Vendor/			//第三方类
----Home/				//前台应用目录
--------Conf/			//配置目录
--------Controller/		//控制器
--------Model/			//模型类
--------View/			//视图
----Admin/				//后台应用目录
--------Conf/			//配置目录
--------Controller/		//控制器
--------Model/			//模型类
--------View/			//视图
----Public/				//静态资源
--------Home/			//前台静态资源
------------Images/		//图片
------------Css/		//CSS目录
------------Js/			//JS目录
--------Admin/			//后台静态资源
------------Images/		//图片
------------Css/		//CSS目录
------------Js/			//JS目录