<?php

//MVC最后的目录结构
----index.php 			//入口文件
----Frame/				//框架核心类文件
----App/				//应用目录
--------Conf/			//配置目录
--------Home/			//前台应用目录
------------Controller/	//前端控制器
------------Model/		//前端模型目录
------------View/		//前端视图目录
--------Admin/			//后台应用目录
------------Controller/	//后端控制器
------------Model/		//后端模型目录
------------View/		//后端视图目录
----Public/				//静态资源目录
--------Home/			//前端静态资源目录
------------Images/		//前端图片目录
------------Css/		//前端CSS目录
------------Js/			//前端JS目录
--------Admin/			//后端静态资源目录
------------Images/		//后端图片目录
------------Css/		//后端CSS目录
------------Js/			//后端JS目录
----Uploads/			//上传文件目录