<?php 
/*
1，要进行从头到尾两两比较并进行交换位置的趟数为$n-1趟，$n是数组长度
2，每次都对相邻的两个数据进行大小比较，如果需要，就交换他们的位置！
3，每趟要比较的次数都比前一趟少1次，第一趟要比较的次数为：$n-1
*/

$arr1 = array(18,  22,  12,   15,  23,  9);
$n = count($arr1);
//控制要进行的趟数
for($i = 0; $i < $n-1; $i++)
{
	//在每一趟里面，控制进行比较的次数
	for($k = 0; $k < $n-1 - $i;  $k++)
	{
		//如果前面一项比后面一项大，就要进行交换
		if($arr1[$k] > $arr1[$k+1] )
		{
			$temp = $arr1[$k];
			$arr1[$k] = $arr1[$k+1];
			$arr1[$k+1] = $temp;
		}
		else{
			//如果不是这样，就什么也不用做
		}
	}
}
echo "<pre>";
print_r($arr1);
echo "</pre>";

//交换原理：
//普通变量的交换
$a = 3;
$b = 4;
//交换上述两个变量的值
$temp = $a;
$a = $b;
$b = $temp;
//数组单元的交换：交换其中的下标为2和下标为6的两个单元的值
$arr2 = [ 2=>15, 3=>18, 6=>20];
$temp = $arr2[2];
$arr2[2] = $arr2[6];
$arr2[6] = $temp;

 ?>